"use client";
import { Pagination, Autoplay } from 'swiper/modules';
import { Swiper, SwiperSlide } from 'swiper/react';
import { Fragment } from "react";
import 'swiper/css';
import 'swiper/css/pagination';

export default function Features ({ settings }) {

    return (

        <Fragment>

            <main>

                <div className="title">{settings.name}</div>

                <div className="describe">
                    تبدأ الحكاية بتأسيس شركة طيبة الخير عام 2008 لتكون أحد أهم الشركات الرائدة 
                    في تقديم منظومة متكاملة من المنتجات والخدمات العقارية، ومنذ أن تأسست الشركة
                        وهي تحمل على عاتقها النهضة بالسوق العقاري بتقديم أجود المنتجات وأفضل الحلول 
                    العقارية لتكون بذلك العلامة الفارقة في مجالها مستندة على ما لها من خبرة في مجال 
                    المزادات وإدارة الإملاك والمقاولات والحراسات القضائية و كذلك بيع المنتجات الإسمنتية.
                </div>

                <div className="hr"><p>أهم ما يميز الشركة - لماذا تختارنا </p></div>

                <div className="features">

                    <ul>

                        <li>
            
                            <svg width="48" height="48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M44.095 12.232c8.614 9.319 1.384 10.945-6.346 18.917-7.73 7.971-13.126 12.63-21.646 
                                    9.951-8.52-2.678-21.465-14.952-13.735-22.923 7.73-7.972 33.113-15.263 41.727-5.945z" fill="#F6ECBB">
                                </path>
                                <path d="M25.082 7.39l3.27 6.933a2.34 2.34 0 001.752 1.328l.008.002 7.297 1.109a.745.745 0 01.376 1.252l-.002.002-5.294 5.398-.004.004a2.447 2.447 0 00-.654 2.104v.001l1.25 7.62.001.01.002.01a.708.708 0 01-.66.837.597.597 0 01-.275-.076l-.006-.003-6.541-3.598H25.6a2.275 2.275 0 00-2.202 0l-6.541 3.598-.006.003a.597.597 0 01-.276.076.707.707 0 01-.66-.837l.003-.01.001-.01 1.25-7.62v-.001a2.447 2.447 0 00-.654-2.104l-.005-.004-5.294-5.398-.001-.002a.745.745 0 01.376-1.252l7.297-1.11h.008a2.34 2.34 0 001.752-1.33l3.27-6.931.004-.008.003-.008A.633.633 0 0124.5 7a.633.633 0 01.575.375l.003.008.004.008z" fill="#fff" stroke="#2A2D32" strokeWidth="2"></path>
                            </svg>

                            <div>

                                <h1>رسالتنا</h1>

                                <p>
                                    الالتزام بطرح الحلول المتطورة والاستشارات
                                    الإبداعية التي تتناسب مع رغبات العملاء، ونتطلع دائمًا لخدمة مميزة تُرضي الجميع
                                </p>

                            </div>
            
                        </li>

                        <li>
            
                            <svg width="49" height="36" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M44.72 6.372c8.614 9.318 1.384 10.945-6.346 18.916-7.73 7.972-13.126 
                                    12.63-21.646 9.952-8.52-2.679-21.465-14.952-13.735-22.924 7.73-7.971 33.113-15.263 41.727-5.944z" 
                                    fill="lightblue">
                                </path>
                                <path fillRule="evenodd" clipRule="evenodd" d="M26.625 18.7c5.176-1.054 9-4.773 9-9.2 0-5.247-5.373-9.5-12-9.5s-12 4.253-12 9.5c0 4.136 3.34 7.655 8 8.96V29h7V18.7z" fill="#fff"></path><path d="M20.685 31.154a2.274 2.274 0 01-2.271-2.272v-3.57h-.974a.974.974 0 010-1.947h1.502l-1.162-3.014c-4.354-1.785-7.155-5.548-7.155-9.642C10.625 4.804 16.303 0 23.281 0c6.979 0 12.657 4.804 12.657 10.71 0 4.093-2.8 7.856-7.156 9.641l-1.161 3.014h1.502a.974.974 0 010 1.948h-.974v3.57a2.274 2.274 0 01-2.272 2.27h-5.192zm-.324-2.272c0 .18.145.325.324.325h5.192c.18 0 .325-.146.325-.325v-3.57H20.36v3.57zm5.172-5.517l.88-2.282a14.691 14.691 0 01-3.132.335c-1.059 0-2.11-.111-3.132-.335l.88 2.282h4.504zM23.281 1.947c-2.639 0-4.867 4.012-4.867 8.762 0 4.75 2.228 8.762 4.867 8.762 2.64 0 4.868-4.012 4.868-8.762 0-4.75-2.229-8.762-4.868-8.762zm-4.603.857c-3.664 1.438-6.106 4.517-6.106 7.905s2.442 6.467 6.106 7.905c-1.389-2.005-2.212-4.877-2.212-7.905 0-3.028.823-5.9 2.212-7.905zm9.206 0c1.39 2.005 2.212 4.877 2.212 7.905 0 3.029-.823 5.9-2.212 7.905 3.665-1.438 6.106-4.517 6.106-7.905s-2.441-6.467-6.106-7.905z" fill="#2A2D32"></path>
                            </svg>
            
                            <div>

                                <h1>هدفنا</h1>
            
                                <p>
                                    نخطط عملًا متقنًا
                                    ، لنحقق حلمًا واعدًا، لنعيش مستقبلًا باهرًا
                                </p>

                            </div>
            
                        </li>

                        <li>
            
                            <svg width="48" height="48" fill="none" xmlns="http://www.w3.org/2000/svg" className='small'>
                                <path d="M44.095 12.372c8.614 9.318 1.384 10.945-6.346 18.916-7.73 7.972-13.126 12.63-21.646 9.952-8.52-2.679-21.465-14.952-13.735-22.924 
                                    7.73-7.971 33.113-15.263 41.727-5.944z" fill="#DEECED">
                                </path>
                                <rect x="11" y="7" width="24" height="24" rx="2" fill="#fff"></rect>
                                <path fillRule="evenodd" clipRule="evenodd" 
                                    d="M17 4a1 1 0 011 1v1h10V5a1 1 0 112 0v1h2.75A3.25 3.25 0 0136 9.25v19.5A3.25 3.25 0 0132.75 32h-19.5A3.25 
                                    3.25 0 0110 28.75V9.25A3.25 3.25 0 0113.25 6H16V5a1 1 0 011-1zm11 4v1a1 1 0 102 0V8h2.75c.69 0 1.25.56 1.25 
                                    1.25V12H12V9.25c0-.69.56-1.25 1.25-1.25H16v1a1 1 0 102 0V8h10zm-16 6v14.75c0 .69.56 1.25 1.25 1.25h19.5c.69 
                                    0 1.25-.56 1.25-1.25V14H12z" fill="#2A2D32">
                                </path>
                            </svg>
            
                            <div>

                                <h1>رؤيتنا</h1>

                                <p>
                                    أن نكون العلامة الفارقة في السوق العقاري بتقديم أعلى معايير
                                    الدقة والمصداقية لدى العملاء، وطرح الفرص التي تناسب تطلعات الطلب التجاري.
                                </p>

                            </div>
            
                        </li>
            
                    </ul>

                </div>

                <div className="features slider">

                    <Swiper modules={[Pagination, Autoplay]} pagination={{clickable: true}} speed={500} spaceBetween={0} slidesPerView={1} className='features-slider'>

                        <SwiperSlide key={1}>
                            <li>
                
                                <svg width="48" height="48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M44.095 12.232c8.614 9.319 1.384 10.945-6.346 18.917-7.73 7.971-13.126 12.63-21.646 
                                        9.951-8.52-2.678-21.465-14.952-13.735-22.923 7.73-7.972 33.113-15.263 41.727-5.945z" fill="#F6ECBB">
                                    </path>
                                    <path d="M25.082 7.39l3.27 6.933a2.34 2.34 0 001.752 1.328l.008.002 7.297 1.109a.745.745 0 01.376 1.252l-.002.002-5.294 5.398-.004.004a2.447 2.447 0 00-.654 2.104v.001l1.25 7.62.001.01.002.01a.708.708 0 01-.66.837.597.597 0 01-.275-.076l-.006-.003-6.541-3.598H25.6a2.275 2.275 0 00-2.202 0l-6.541 3.598-.006.003a.597.597 0 01-.276.076.707.707 0 01-.66-.837l.003-.01.001-.01 1.25-7.62v-.001a2.447 2.447 0 00-.654-2.104l-.005-.004-5.294-5.398-.001-.002a.745.745 0 01.376-1.252l7.297-1.11h.008a2.34 2.34 0 001.752-1.33l3.27-6.931.004-.008.003-.008A.633.633 0 0124.5 7a.633.633 0 01.575.375l.003.008.004.008z" fill="#fff" stroke="#2A2D32" strokeWidth="2"></path>
                                </svg>

                                <div>

                                    <h1>رسالتنا</h1>

                                    <p>
                                        الالتزام بطرح الحلول المتطورة والاستشارات
                                        الإبداعية التي تتناسب مع رغبات العملاء، ونتطلع دائمًا لخدمة مميزة تُرضي الجميع
                                    </p>

                                </div>
                
                            </li>
                        </SwiperSlide>
                        <SwiperSlide key={2}>
                            <li>
                
                                <svg width="49" height="36" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M44.72 6.372c8.614 9.318 1.384 10.945-6.346 18.916-7.73 7.972-13.126 
                                        12.63-21.646 9.952-8.52-2.679-21.465-14.952-13.735-22.924 7.73-7.971 33.113-15.263 41.727-5.944z" 
                                        fill="lightblue">
                                    </path>
                                    <path fillRule="evenodd" clipRule="evenodd" d="M26.625 18.7c5.176-1.054 9-4.773 9-9.2 0-5.247-5.373-9.5-12-9.5s-12 4.253-12 9.5c0 4.136 3.34 7.655 8 8.96V29h7V18.7z" fill="#fff"></path><path d="M20.685 31.154a2.274 2.274 0 01-2.271-2.272v-3.57h-.974a.974.974 0 010-1.947h1.502l-1.162-3.014c-4.354-1.785-7.155-5.548-7.155-9.642C10.625 4.804 16.303 0 23.281 0c6.979 0 12.657 4.804 12.657 10.71 0 4.093-2.8 7.856-7.156 9.641l-1.161 3.014h1.502a.974.974 0 010 1.948h-.974v3.57a2.274 2.274 0 01-2.272 2.27h-5.192zm-.324-2.272c0 .18.145.325.324.325h5.192c.18 0 .325-.146.325-.325v-3.57H20.36v3.57zm5.172-5.517l.88-2.282a14.691 14.691 0 01-3.132.335c-1.059 0-2.11-.111-3.132-.335l.88 2.282h4.504zM23.281 1.947c-2.639 0-4.867 4.012-4.867 8.762 0 4.75 2.228 8.762 4.867 8.762 2.64 0 4.868-4.012 4.868-8.762 0-4.75-2.229-8.762-4.868-8.762zm-4.603.857c-3.664 1.438-6.106 4.517-6.106 7.905s2.442 6.467 6.106 7.905c-1.389-2.005-2.212-4.877-2.212-7.905 0-3.028.823-5.9 2.212-7.905zm9.206 0c1.39 2.005 2.212 4.877 2.212 7.905 0 3.029-.823 5.9-2.212 7.905 3.665-1.438 6.106-4.517 6.106-7.905s-2.441-6.467-6.106-7.905z" fill="#2A2D32"></path>
                                </svg>
                
                                <div>

                                    <h1>هدفنا</h1>
                
                                    <p>
                                        نخطط عملًا متقنًا
                                        ، لنحقق حلمًا واعدًا، لنعيش مستقبلًا باهرًا
                                    </p>

                                </div>
                
                            </li>
                        </SwiperSlide>
                        <SwiperSlide key={3}>
                            <li>
                
                                <svg width="48" height="48" fill="none" xmlns="http://www.w3.org/2000/svg" className='small'>
                                    <path d="M44.095 12.372c8.614 9.318 1.384 10.945-6.346 18.916-7.73 7.972-13.126 12.63-21.646 9.952-8.52-2.679-21.465-14.952-13.735-22.924 
                                        7.73-7.971 33.113-15.263 41.727-5.944z" fill="#DEECED">
                                    </path>
                                    <rect x="11" y="7" width="24" height="24" rx="2" fill="#fff"></rect>
                                    <path fillRule="evenodd" clipRule="evenodd" 
                                        d="M17 4a1 1 0 011 1v1h10V5a1 1 0 112 0v1h2.75A3.25 3.25 0 0136 9.25v19.5A3.25 3.25 0 0132.75 32h-19.5A3.25 
                                        3.25 0 0110 28.75V9.25A3.25 3.25 0 0113.25 6H16V5a1 1 0 011-1zm11 4v1a1 1 0 102 0V8h2.75c.69 0 1.25.56 1.25 
                                        1.25V12H12V9.25c0-.69.56-1.25 1.25-1.25H16v1a1 1 0 102 0V8h10zm-16 6v14.75c0 .69.56 1.25 1.25 1.25h19.5c.69 
                                        0 1.25-.56 1.25-1.25V14H12z" fill="#2A2D32">
                                    </path>
                                </svg>
                
                                <div>

                                    <h1>رؤيتنا</h1>

                                    <p>
                                        أن نكون العلامة الفارقة في السوق العقاري بتقديم أعلى معايير
                                        الدقة والمصداقية لدى العملاء، وطرح الفرص التي تناسب تطلعات الطلب التجاري.
                                    </p>

                                </div>
                
                            </li>
                        </SwiperSlide>

                    </Swiper>

                </div>

            </main>

        </Fragment>

    )

}
